app/controllers/articles_controller.rb

INSERT INTO `articles` (`title`, `text`, `image`, `created_at`, `updated_at`) VALUES ('aaaaaaaaaaaaaaaaa', 'aaaaaaaaaaaaaaaaaaa', 'cats-that-stay-small1.lg.jpg', '2016-10-03 13:06:16', '2016-10-03 13:06:16')
---
	def create
  		@article = Article.new(article_params)

 	 	if @article.save

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `title` = 'fgkjkjm,n', `updated_at` = '2016-09-15 12:23:02' WHERE `articles`.`id` = 1
---
    def update
  		@article = Article.find(params[:id])

  		if @article.update(article_params)

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 1
---
    def destroy
      @article = Article.find(params[:id])
      @article.destroy