app/controllers/questions_controller.rb

INSERT INTO `questions` (`question`, `option1`, `option2`, `option3`, `option4`, `correct_option`, `created_at`, `updated_at`) VALUES ('gdfgd', 'fd', 'fd', 'fd', 'df', 2, '2016-10-10 06:50:33', '2016-10-10 06:50:33')
---
	def create

		#render plain: params[:question].inspect
		@question = Question.new(question_params)

		if @question.save

SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
DELETE FROM `questions` WHERE `questions`.`id` = 1
---
	def destroy
		@question = Question.find(params[:id])
		@question.destroy

SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
---
	def show
		@question = Question.find(params[:id])

SELECT `questions`.* FROM `questions`
---
	def index
		@questions = Question.all